app/views/posts/show_post.html.erb


<%= @post.likes.count %> Likes

<% current_user =  User.find(session[:user_id]) %>
<% like = current_user.likes.find_by(post: @post) %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 11]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 11], ["LIMIT", 1]]