app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def new
        @post = Post.find(params[:post_id])#find the post by postId params

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "message_comment", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["post_id", 1], ["message_comment", "Great post!"], ["created_at", "2024-10-10 08:34:55.053404"], ["updated_at", "2024-10-10 08:34:55.053404"], ["user_id", 1]]
---
    def create
        @post = Post.find(params[:post_id]) # ensure it is the correct post
        @comment = @post.comments.build(comment_params)# Associate comment with post
        @comment.user_id = session[:user_id]#assign the user

        if @comment.save