app/controllers/followers_controller.rb

  def create()

    followed_id = params[:follower][:followed_id]
    @relationship = Follower.new(follower_id: session[:user_id], followed_id: followed_id)

    if Follower.exists?(follower_id: session[:user_id], followed_id: followed_id)
      flash[:message] = "You are already following this user."
      # p 'you alredy follow this user'
    elsif @relationship.save
---
SELECT 1 AS one FROM "followers" WHERE "followers"."follower_id" = ? AND "followers"."followed_id" = ? LIMIT ?  [["follower_id", 5], ["followed_id", 6], ["LIMIT", 1]]
INSERT INTO "followers" ("created_at", "updated_at", "follower_id", "followed_id") VALUES (?, ?, ?, ?) RETURNING "id"  [["created_at", "2024-10-08 15:32:59.435578"], ["updated_at", "2024-10-08 15:32:59.435578"], ["follower_id", 5], ["followed_id", 6]]