app/controllers/posts_controller.rb

INSERT INTO "posts" ("message", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["message", "Hello, world!"], ["created_at", "2024-09-30 10:44:28.433758"], ["updated_at", "2024-09-30 10:44:28.433758"]]
---
  def create

    # created with params
    @post = Post.new(post_params)

    # added session to post
    @post.user_id = session[:user_id]

    # save! --- raises an error if fails
    if @post.save