app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "message", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["message", "ghg"], ["image", nil], ["created_at", "2024-10-04 11:54:35.333275"], ["updated_at", "2024-10-04 11:54:35.333275"]]
---
  def create

    # created with params
    @post = Post.new(post_params)

    # added session to post
    @post.user_id = session[:user_id]

    # save! --- raises an error if fails
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "message" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["message", "what a nice dayghgj"], ["updated_at", "2024-10-04 09:07:33.529202"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    if  @post.user_id = session[:user_id]
      if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:id])
    if @post.user_id == session[:user_id]
      @post.destroy