app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "followers"."followed_id" FROM "followers" WHERE "followers"."follower_id" = ?  [["follower_id", 5]]
SELECT "users"."username", "users"."id" FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def index
    @users = User.all

    following_ids = Follower.where(follower_id: session[:user_id]).pluck(:followed_id)
    # p "###### #{following_ids}"
    @following_users = User.where(id: following_ids).pluck(:username, :id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @posts = Post.where(user_id: @user.id).order(created_at: :desc)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
---
  def destroy
    p 'account deleted'
    @user = User.find(params[:id])
    if @user.id == session[:user_id] && @user.destroy